testing/case_1p0/0/R
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      R;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<symmTensor> 
10981
(
(3.40078e-06 -6.49475e-07 -5.78368e-32 3.40586e-06 0 3.40342e-06)
(1.84029e-05 -1.01971e-05 -2.21883e-30 1.8241e-05 0 1.83286e-05)
(2.28576e-05 -1.11552e-05 0 2.19612e-05 0 2.24176e-05)
(2.52012e-05 -1.14652e-05 0 2.3284e-05 0 2.42392e-05)
(2.68184e-05 -1.1172e-05 0 2.3781e-05 0 2.52972e-05)
(2.81748e-05 -1.04156e-05 6.83302e-30 2.4077e-05 0 2.61238e-05)
(2.9453e-05 -9.37198e-06 -1.83936e-29 2.44078e-05 0 2.69268e-05)
(3.07038e-05 -8.18711e-06 0 2.4829e-05 0 2.77612e-05)
...
)
;

boundaryField
{
    bottomWall
    {
        type            calculated;
        value           nonuniform List<symmTensor> 
139
(
(7.03207e-08 0 0 7.03207e-08 0 7.03207e-08)
(6.8138e-08 0 0 6.8138e-08 0 6.8138e-08)
(6.56684e-08 0 0 6.56684e-08 0 6.56684e-08)
(5.55426e-08 0 0 5.55426e-08 0 5.55426e-08)
(4.72438e-08 0 0 4.72438e-08 0 4.72438e-08)
(3.74728e-08 0 0 3.74728e-08 0 3.74728e-08)
(2.69939e-08 0 0 2.69939e-08 0 2.69939e-08)
(1.74222e-08 0 0 1.74222e-08 0 1.74222e-08)
...
)
;
    }
    defaultFaces
    {
        type            empty;
    }
    topWall
    {
        type            calculated;
        value           nonuniform List<symmTensor> 
139
(
(8.35127e-09 0 0 8.35127e-09 0 8.35127e-09)
(8.40633e-09 0 0 8.40633e-09 0 8.40633e-09)
(8.461e-09 0 0 8.461e-09 0 8.461e-09)
(8.5446e-09 0 0 8.5446e-09 0 8.5446e-09)
(8.6696e-09 0 0 8.6696e-09 0 8.6696e-09)
(8.85073e-09 0 0 8.85073e-09 0 8.85073e-09)
(9.10593e-09 0 0 9.10593e-09 0 9.10593e-09)
(9.44973e-09 0 0 9.44973e-09 0 9.44973e-09)
...
)
;
    }
    outlet
    {
        type            cyclic;
    }
    inlet
    {
        type            cyclic;
    }
}


// ************************************************************************* //
