testing/case_1p0/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "20000";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   nonuniform List<scalar> 
10981
(
5.67225e-06
5.04239e-06
3.84242e-06
2.92452e-06
2.2358e-06
1.73528e-06
1.37881e-06
1.12501e-06
...
)
;

boundaryField
{
    bottomWall
    {
        type            epsilonWallFunction;
        value           nonuniform List<scalar> 
139
(
5.67225e-06
5.58167e-06
5.47681e-06
5.03787e-06
4.6736e-06
4.24274e-06
3.75472e-06
3.23963e-06
...
)
;
    }
    defaultFaces
    {
        type            empty;
    }
    topWall
    {
        type            epsilonWallFunction;
        value           nonuniform List<scalar> 
139
(
1.92043e-06
1.92682e-06
1.93283e-06
1.9391e-06
1.94385e-06
1.94657e-06
1.94646e-06
1.9427e-06
...
)
;
    }
    outlet
    {
        type            cyclic;
    }
    inlet
    {
        type            cyclic;
    }
}


// ************************************************************************* //
