testing/case_1p0/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "20000";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
10981
(
5.10503e-06
2.74862e-05
3.36182e-05
3.63622e-05
3.79483e-05
3.91878e-05
4.03938e-05
4.1647e-05
...
)
;

boundaryField
{
    bottomWall
    {
        Ceps2           1.9;
        type            kLowReWallFunction;
        value           nonuniform List<scalar> 
139
(
1.05481e-07
1.02207e-07
9.85026e-08
8.33139e-08
7.08657e-08
5.62092e-08
4.04908e-08
2.61333e-08
...
)
;
    }
    defaultFaces
    {
        type            empty;
    }
    topWall
    {
        Ceps2           1.9;
        type            kLowReWallFunction;
        value           nonuniform List<scalar> 
139
(
1.25269e-08
1.26095e-08
1.26915e-08
1.28169e-08
1.30044e-08
1.32761e-08
1.36589e-08
1.41746e-08
...
)
;
    }
    outlet
    {
        type            cyclic;
    }
    inlet
    {
        type            cyclic;
    }
}


// ************************************************************************* //
