testing/case_1p0/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "20000";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
21744
(
-6.75771e-08
3.89728e-06
9.51521e-09
8.25204e-06
2.46552e-07
1.12998e-05
6.08387e-07
1.40573e-05
...
)
;

boundaryField
{
    bottomWall
    {
        type            calculated;
        value           uniform 0;
    }
    defaultFaces
    {
        type            empty;
        value           nonuniform 0();
    }
    topWall
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            cyclic;
        value           nonuniform List<scalar> 
79
(
3.8297e-06
8.32913e-06
1.15369e-05
1.44191e-05
1.7133e-05
1.9739e-05
2.22909e-05
2.4841e-05
...
)
;
    }
    inlet
    {
        type            cyclic;
        value           nonuniform List<scalar> 
79
(
-3.8297e-06
-8.32913e-06
-1.15369e-05
-1.44191e-05
-1.7133e-05
-1.9739e-05
-2.22909e-05
-2.4841e-05
...
)
;
    }
}


// ************************************************************************* //
